[
    {
        "id": "gd-financial-dispute",
        "title": "Filing a General Diary for Financial Disputes",
        "description": "Step-by-step guide to file a GD when someone owes you money or refuses to return your deposit",
        "category": "Legal",
        "steps": [
            {
                "title": "Gather Required Documents",
                "description": "Collect your rental agreement, deposit receipt, any written communication with landlord, and your National ID card."
            },
            {
                "title": "Visit the Police Station",
                "description": "Go to the police station in the area where the dispute occurred. You can file a GD at any time during office hours."
            },
            {
                "title": "Request GD Form",
                "description": "Ask the duty officer for a General Diary form. Explain that you want to file a complaint about a financial dispute."
            },
            {
                "title": "Fill Out the Form",
                "description": "Provide complete details: your information, landlord's information, incident details, amount involved, and timeline of events."
            },
            {
                "title": "Submit and Get Receipt",
                "description": "Submit the form and ensure you get a copy with the GD number and official stamp. Keep this safe as proof of filing."
            }
        ],
        "actionText": "Generate a GD Draft",
        "actionTarget": "gd"
    },
    {
        "id": "consumer-complaint",
        "title": "Filing a Consumer Complaint",
        "description": "How to file a complaint for defective products or poor services under Consumer Rights Protection Act 2009",
        "category": "Consumer Rights",
        "steps": [
            {
                "title": "Document Your Case",
                "description": "Gather purchase receipts, product photos, warranty cards, defect evidence, and any communication with the seller. Under Section 6 of the Act, proper documentation strengthens your case."
            },
            {
                "title": "Contact the Seller First",
                "description": "Try to resolve directly with the seller/manufacturer. Keep written records of these attempts. This shows good faith effort before formal complaint."
            },
            {
                "title": "Visit Consumer Rights Office",
                "description": "Go to your District Consumer Rights Protection Office or the Directorate of National Consumer Rights Protection. Find office locations and contact details."
            },
            {
                "title": "File Written Complaint",
                "description": "Submit complaint with supporting documents. Include timeline, financial loss, desired resolution. Fee: Usually 50-200 Taka depending on claim amount."
            },
            {
                "title": "Follow Up and Attend Hearings",
                "description": "Keep your complaint receipt number. Attend scheduled hearings. You may get compensation, replacement, or refund as per Act provisions."
            }
        ],
        "actionText": "Generate a Consumer Complaint Letter",
        "actionTarget": "complaint"
    },
    {
        "id": "police-complaint",
        "title": "Filing a Police Complaint",
        "description": "General guide for filing police complaints and FIRs",
        "category": "Legal",
        "steps": [
            {
                "title": "Determine Complaint Type",
                "description": "Decide if your issue requires an FIR (for serious crimes) or a General Diary (for other issues)."
            },
            {
                "title": "Prepare Your Statement",
                "description": "Write down all details: what happened, when, where, who was involved, and any witnesses."
            },
            {
                "title": "Visit Police Station",
                "description": "Go to the police station with jurisdiction over the area where the incident occurred."
            },
            {
                "title": "File the Complaint",
                "description": "Provide your statement to the duty officer. For FIRs, police must register immediately for cognizable offenses."
            },
            {
                "title": "Get Documentation",
                "description": "Ensure you receive a copy of your complaint with case/GD number and officer's signature."
            }
        ],
        "actionText": "Generate a Complaint Draft",
        "actionTarget": "complaint"
    },
    {
        "id": "birth-certificate",
        "title": "Obtaining a Birth Certificate",
        "description": "Complete guide to get your birth certificate from government offices",
        "category": "Government Services",
        "steps": [
            {
                "title": "Determine the Right Office",
                "description": "Visit the Registrar office of the area where you were born, or your local Union Parishad."
            },
            {
                "title": "Collect Required Documents",
                "description": "Bring hospital birth certificate, school admission certificate, parents' ID cards, and recent passport-size photos."
            },
            {
                "title": "Fill Application Form",
                "description": "Complete the birth registration application form with accurate information. Double-check all details."
            },
            {
                "title": "Pay Fees",
                "description": "Pay the prescribed government fee. Keep the receipt as proof of payment."
            },
            {
                "title": "Submit and Track",
                "description": "Submit your application and get a receipt with application number. Use this to track your application status."
            }
        ],
        "actionText": "Generate an Application",
        "actionTarget": "application"
    },
    {
        "id": "passport-application",
        "title": "Applying for a Passport",
        "description": "Step-by-step process to apply for a Bangladeshi passport",
        "category": "Government Services",
        "steps": [
            {
                "title": "Online Pre-Application",
                "description": "Visit the official passport website and fill out the online application form. Print the confirmation page."
            },
            {
                "title": "Prepare Documents",
                "description": "Gather birth certificate, National ID, photographs, and other required documents as per the checklist."
            },
            {
                "title": "Visit Passport Office",
                "description": "Go to your designated passport office with all documents and the printed application form."
            },
            {
                "title": "Verification and Payment",
                "description": "Complete the verification process, pay fees, and provide biometric data (fingerprints and photo)."
            },
            {
                "title": "Collection",
                "description": "Wait for the specified time and collect your passport on the given date with the receipt."
            }
        ],
        "actionText": "Generate an Application",
        "actionTarget": "application"
    },
    {
        "id": "trade-license",
        "title": "Getting a Trade License",
        "description": "How to obtain a trade license for your business",
        "category": "Business",
        "steps": [
            {
                "title": "Choose License Type",
                "description": "Determine what type of trade license you need based on your business category and location."
            },
            {
                "title": "Prepare Business Documents",
                "description": "Gather business registration papers, owner's NID, business address proof, and bank statements."
            },
            {
                "title": "Visit City Corporation/Municipality",
                "description": "Go to your local City Corporation or Municipality office with all required documents."
            },
            {
                "title": "Application and Inspection",
                "description": "Submit application with fees. Officials may inspect your business location."
            },
            {
                "title": "License Issuance",
                "description": "After verification and approval, collect your trade license certificate."
            }
        ],
        "actionText": "Generate an Application",
        "actionTarget": "application"
    },
    {
        "id": "rti-application",
        "title": "Filing an RTI Application",
        "description": "How to request government information under Right to Information Act 2009",
        "category": "Government Transparency",
        "steps": [
            {
                "title": "Identify the Right Authority",
                "description": "Determine which government office/department holds the information you need. Each ministry, department, and local government body is covered under the Act."
            },
            {
                "title": "Prepare Your Application",
                "description": "Write a clear application stating what specific information you want. Be precise - vague requests may be rejected. Include your contact details and reason (optional)."
            },
            {
                "title": "Submit with Fee",
                "description": "Submit application to the designated officer with 2 Taka fee per page for information. For BPL (Below Poverty Line) citizens, the fee is waived."
            },
            {
                "title": "Wait for Response",
                "description": "Authority must respond within 20 working days (Section 9). If information affects third parties, they have additional 30 days after consultation."
            },
            {
                "title": "Appeal if Necessary",
                "description": "If request is denied or ignored, you can appeal to the Information Commission within 30 days. Appeals are free of cost."
            }
        ],
        "actionText": "Generate an RTI Application",
        "actionTarget": "rti"
    },
    {
        "id": "family-court-overview",
        "title": "Family Court Basics",
        "description": "High-level overview for maintenance/divorce/child custody under Family Courts Ordinance 2023",
        "category": "Family Courts",
        "steps": [
            {
                "title": "Identify Your Matter",
                "description": "Confirm if your issue relates to maintenance, dower, dissolution of marriage, or custody."
            },
            {
                "title": "Collect Basic Documents",
                "description": "NID, marriage/divorce documents (if any), birth certificates (for children), and any relevant receipts/records."
            },
            {
                "title": "Draft a Plain Application",
                "description": "Prepare a simple statement of facts and relief sought. This demo provides only a generic template."
            },
            {
                "title": "Submit to Family Court",
                "description": "File at the appropriate Family Court with court fees as applicable."
            }
        ],
        "actionText": "Generate a Basic Application",
        "actionTarget": "application"
    },
    {
        "id": "road-transport-basics",
        "title": "Road Transport Basics",
        "description": "Essential steps for traffic fines and documents under the Road Transport Act 2018",
        "category": "Road Safety",
        "steps": [
            {
                "title": "Keep Documents Ready",
                "description": "Driving license, registration, fitness, insurance. Ensure validity to avoid penalties."
            },
            {
                "title": "Fine and Payment",
                "description": "If fined, pay through official channels and keep the receipt. This demo does not integrate payment."
            },
            {
                "title": "Dispute Option",
                "description": "You may seek legal remedy for wrongful fines following due procedures. This demo shows generic steps only."
            }
        ],
        "actionText": "Generate a Generic Application",
        "actionTarget": "application"
    }
]